# InitialFluxIntensity Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
InitialFluxIntensity Methods
InitialFluxIntensity Class See Also
---
The InitialFluxIntensity type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Clone | Creates a copy of the InitialIntensity derived object.  (Inherited from InitialIntensity.) |
| Dispose | (Inherited from InitialIntensity.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
InitialFluxIntensity Class
Autodesk.Revit.DB.Lighting Namespace